README.org
* dotfiles
A repository of configuration files optimized for FactSet Engineering environments
**  Quick Start
*** Clone this repository
~$ git clone git@gitlab.factset.com:amavrakis/dotfiles.git =~=~
*** Upgrade your software
**** Quick Upgrade =[not recommended]=
In the process of setting up my environment I've installed a few dependencies into my ~local/bin/~ dir add the following line to your ~.profile-user~ to bootstrap the setup process:
~export PATH=home/user/amavrakis/local/bin/:$PATH~
**** Custom Upgrade
It is recommended that you check out all of the software in that directory and install them one by one by adding them to your path or installing them from source.
~export PATH=home/user/amavrakis/local/bin/emacs:$PATH~
~export PATH=home/user/amavrakis/local/bin/git:$PATH~
If you wish to install software from source, most likely you will need to prefix the configuration with a flag...something like this:
~$ ./configure --prefix=/home/user/amavrakis/local/~
*** GNU Stow
GNU stow is a simple utility to make configuration file management easier. If you want to use a configuration in this directory and you have stow installed or you've sourced my ~local/bin/~ directory, follow the steps below to quickly soft link these files into your home dir.

